// Массив как тип данных

// let a = [1,2,3,4,5,4,7]

// a.length         - общее колисество элементов (7)

// a[3]             - индексация по элементам
// a[10]            - неизвестный индекс вернет undefined
// a[-3]            - неизвестный индекс вернет undefined

// a[0] = 'string'  -   перепоределение значение индекса
// [ 'string', 2, 3, 4, 5, 6, 7 ]

// a[7] = 'восемь'  -   также можно создать новый индекс с новым значением
// [ 1, 2, 3, 4, 5, 6, 7, 'восемь' ]

// a[20] = 'восемь' - создание 20 индекса. Длина массива будет учитывать в том учисле пустые элемента
// [ 1, 2, 3, 4, 5, 6, 7, <13 empty items>, 'восемь' ]

// --------
// Не полное удаление
// delete a[0]     - удаление только значения (индекс остается)
// [ <1 empty item>, 2, 3, 4, 5, 6, 7 ]

// ---------------------------------
// Методы массива

// pop()        -   метод массива, который удаляет последний элемент. Возвращает удаляемый элемент
// push(n)      -   метод массива, который добавляет новый элемент в самый конец. Возвращает добавленный элемент
// shift()      -   метод массива, который удаляет первый элемент. Возвращает удаляемый элемент
// unshift(n)   -   метод массива, который добавляет новый элемент в начале массива. Возвращает добавленный элемент

// Вышеуказанные методы мутируют массив

// let a = [1,2,3,4,5,6,7]
// let b = a.push(8)
// console.log(a)
// console.log(b)

// --------------------
// Пример метода, который не миутрует массив
// slice()

// let a = [1,2,3,4,5,6,7]
// let b = a.slice(0,4)
// console.log(a,b)


// ------------------------
// Задача 1

// let fruits = ["Яблоко", "Ананас", "Виноград","Клубника", "Груша", "Мандарин"]

// 1) Добавить в конце "Смородина"
// 2) Удалить Яблоко
// 3) Удалить Ананас
// 4) Удалить последний элемент
// 5) Добавить в начале "Абрикос"

// Решение 

// fruits.push('Смородина')
// fruits.shift()
// fruits.shift()
// fruits.pop()
// fruits.unshift('Абрикос')

// console.log(fruits)

// -----------------------------
// for для массива
// let fruits = ["Яблоко", "Ананас", "Виноград","Клубника", "Груша", "Мандарин"]

// for (let i = 0; i < fruits.length; i++){
//     fruits[i] = fruits[i] + ' привет!'
// }

// console.log(fruits)

// --------------
// короткая форма зписи цикла (для массива)
// где elem - это значение элемента массива

// Цикл по значением
// for (let elem of fruits){
//     console.log(elem)        // elem - значелние элемента массива
// }

// Цикл по индексам
// где i - это значение индексов элементов массива

// for (let elem in fruits){
//     console.log(elem)        // elem - индекс элемента массива
// }

// console.log(fruits)

// ---------------------------------------------
// Сравнение массивов 

// let a = [1,2,3]
// let b = [1,2,3] 

// Переменные a и b хранят не значение массива, а путь в области ячейки памяти, где находиться само занчение массива
// console.log(a === b)
// false

// ---------------
// Переменная b не будет хранить значение коипии массива a. 
// Переменная b полностью скопирует адрес памяти переменной a, фактически сформировар не копию, а 
// дополнительный ярлык к 1 массиву. Меняя массив а, автоматически будет меняться массив b (это 1 и тот же массив)

// let a = [1,2,3]
// let b = a

// a.pop()

// console.log(a === b)
// true

// console.log(a)
// console.log(b)
// [ 1, 2 ]
// [ 1, 2 ]

// --------------------------
// Копия массива

// let a = [1,2,3]
// let b = a.slice()

// a.pop()

// console.log(a)
// console.log(b)

// [ 1, 2 ]
// [ 1, 2, 3 ]


// -----------------------------------
// Задача 1.
// Используя новый формат цикла, вывести в консоль тольке те элементы, которые делятся на 2 без остатка
// let array = [1,2,3,4,5,6,7,8]

// for (let elem of array){
//     if( elem % 2 == 0){
//         console.log(elem)
//     }
// }

// --------------------------------
// Задача 2 
// let array = [1,2,3,4,5,6,7,8]
// Измените массив таким образом, чтобы значения элементов передавали их квадрат. 

// for (let i in array){
//     array[i] = array[i] ** 2
// }

// console.log(array)


// ---------------------------------
// let names = [ 
//     'Steven Dima', 
//     'Alex NULL',
//     'Glandell NULL', 
//     'Neena', 
//     'John', 
//     'Peter Peter NULL'
// ]

// for (let i in names){
//     let array_elem = names[i].split(' ')
//     if(array_elem.length !== 1){
//         if (array_elem[array_elem.length -1] === 'NULL'){
//             array_elem.pop()
//             names[i] = array_elem.join(' ')
//         }
//     } 
// }

// console.log(names)
    
// 1) includes('NULL')
// 2) endsWith('NULL')
// 3) indexOf('NULL') != -1
// 4) names[i].slice(-4) == 'NULL'
// 5) names[i].split(' ').length === 2

// Задача метода join - преобразовать массив в строковый, 
// сконкатенировав каждый элемент друг с другом, указав общий разделитель

// let array = ['Раз',"Два","Три"]
// let result = array.join('')
// console.log(result)
